# Міліон секунд від дати народення
my_birthday = Time.mktime(1986,02,26,7,00,58)
my_bil_sec = my_birthday + (1000000000)
now = Time.new
if my_bil_sec <= now
  puts "Мені виповнилося 1000000000 секунд в " + my_bil_sec.to_s
else
  puts "Мені виповниться 1000000000 секунд в " + my_bil_sec.to_s
end
puts ""
puts "1000000000 секунд це: " + (1000000000 / 60).to_s + " хвилин"
puts "1000000000 секунд це: " + (1000000000 / 3600).to_s + " годин"
puts "1000000000 секунд це: " + (1000000000 / 86400).to_s + " днів"
puts "1000000000 секунд це: " + (1000000000 / 31536000).to_s + " років"
