Projects/blog/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "444"], ["text", "text444"], ["created_at", "2020-02-04 20:39:25.948592"], ["updated_at", "2020-02-04 20:39:25.948592"]]
---
  def create
    # render plain: params[:article].inspect
    @article = Article.new(article_params)

    @article.save